In [1]:
import pandas as pd

In [3]:
pd.__version__

'2.2.3'

In [6]:
list = [11,12,2,34,56,78,89,90]
myvar = pd.Series(list)
myvar

0    11
1    12
2     2
3    34
4    56
5    78
6    89
7    90
dtype: int64

In [9]:
#indexing
myvar[3]

np.int64(34)

In [12]:
a = [1,7,4]
myvar = pd.Series(a,index=["a","b","c"])
print(myvar)
myvar["b"]

a    1
b    7
c    4
dtype: int64

np.int64(7)

In [15]:
#lables created automatically
employee = {
    "id":1,
    "name":"Alice",
    "email":"alice@gmail.com",
    "address":"Mysore",
    "salary":980000
}
data = pd.Series(employee)
print(data)
print(data["id"])
data["name"]

id                       1
name                 Alice
email      alice@gmail.com
address             Mysore
salary              980000
dtype: object
1

'Alice'

In [20]:
#Dataframes  
data = {
    "name": ["Alice","Bob","Charls"],
    "Age": [25,30,35],
    "City": ["NYC","LA","Chicago"]
}
df = pd.DataFrame(data)
df

     name  Age     City
0   Alice   25      NYC
1     Bob   30       LA
2  Charls   35  Chicago

In [22]:
data = {
    "name": ["Alice","Bob","Charls"],
    "Age": [25,30,35]
}
df = pd.DataFrame(data)
print(df)
print(df.loc[0])
print(df.loc[[0,2]])

     name  Age
0   Alice   25
1     Bob   30
2  Charls   35
name    Alice
Age        25
Name: 0, dtype: object
     name  Age
0   Alice   25
2  Charls   35

In [28]:
user_data = {
    "age": [25,30,35],
    "name": ["Alice","Bob","Charls"],
    "salary":[2345678,234563456,123456],
    "email":["alice@gmail.com","bob@gmail.com","charls@gmail.com"]
}
df1 = pd.DataFrame(user_data,columns=["age","name","email","salary"])
df1

   age    name             email     salary
0   25   Alice   alice@gmail.com    2345678
1   30     Bob     bob@gmail.com  234563456
2   35  Charls  charls@gmail.com     123456

In [30]:
data = [
    ["Alice",25,"NYC"],
    ["Bob",34,"LA"],
    ["Chatlie",30,"Chicago"],
    ["David",49,"Hoston"]
]
df = pd.DataFrame(data,columns=["name","age","city"])
df

      name  age     city
0    Alice   25      NYC
1      Bob   34       LA
2  Chatlie   30  Chicago
3    David   49   Hoston

In [31]:
student_data = pd.read_csv('student_data.csv')
print(student_data)

     id        first_name    last_name                            email  \
0     1     Ilsa McKinnon     McKinnon               imckinnon0@cmu.edu
1     2  Anabel Atterbury    Atterbury           aatterbury1@paypal.com
2     3       Nappie Yude         Yude               nyude2@twitpic.com
3     4   Derby O'Mahoney    O'Mahoney                domahoney3@qq.com
4     5  Lura MacNaughton  MacNaughton        lmacnaughton4@storify.com
..  ...               ...          ...                              ...
95   96      Fae Fruchter     Fruchter               ffruchter2n@un.org
96   97      Scotti Tiddy        Tiddy  stiddy2o@scientificamerican.com
97   98    Kingsly Upsale       Upsale             kupsale2p@taobao.com
98   99    Irwin Olivazzi     Olivazzi           iolivazzi2q@sphinn.com
99  100    Devy Ratcliffe    Ratcliffe               dratcliffe2r@51.la

     gender  grade
0    Female   5.15
1    Female   4.97
2      Male   1.63
3      Male   9.83
4    Female   4.21
..      ...    ...
95   Female   3.65
96     Male   9.93
97  Agender   8.48
98  Agender   6.17
99     Male   1.38

[100 rows x 6 columns]

In [32]:
student_data.head()

   id        first_name    last_name                      email  gender  grade
0   1     Ilsa McKinnon     McKinnon         imckinnon0@cmu.edu  Female   5.15
1   2  Anabel Atterbury    Atterbury     aatterbury1@paypal.com  Female   4.97
2   3       Nappie Yude         Yude         nyude2@twitpic.com    Male   1.63
3   4   Derby O'Mahoney    O'Mahoney          domahoney3@qq.com    Male   9.83
4   5  Lura MacNaughton  MacNaughton  lmacnaughton4@storify.com  Female   4.21

In [38]:
print(student_data.to_string())

     id            first_name    last_name                            email       gender  grade
0     1         Ilsa McKinnon     McKinnon               imckinnon0@cmu.edu       Female   5.15
1     2      Anabel Atterbury    Atterbury           aatterbury1@paypal.com       Female   4.97
2     3           Nappie Yude         Yude               nyude2@twitpic.com         Male   1.63
3     4       Derby O'Mahoney    O'Mahoney                domahoney3@qq.com         Male   9.83
4     5      Lura MacNaughton  MacNaughton        lmacnaughton4@storify.com       Female   4.21
5     6     Eolanda Thomasset    Thomasset   ethomasset5@barnesandnoble.com       Female   8.70
6     7         Bendix Pembry       Pembry             bpembry6@cornell.edu         Male   9.82
7     8     Marcellina Clemon       Clemon                mclemon7@about.me       Female   5.66
8     9           Quinn Falla        Falla                 qfalla8@dell.com         Male   7.01
9    10         Aleta Fairlem      Fairlem                afairlem9@nps.gov       Female   2.89
10   11         Miner Artharg      Artharg                martharga@nih.gov         Male   1.26
11   12        Taryn Skilbeck     Skilbeck            tskilbeckb@devhub.com     Bigender   4.78
12   13  Herculie Eixenberger  Eixenberger            heixenbergerc@epa.gov         Male   5.89
13   14    Katharine Roggeman     Roggeman          kroggemand@springer.com       Female   1.67
14   15          Yanaton Iffe         Iffe                 yiffee@vimeo.com         Male   1.35
15   16          Sauncho Real         Real            srealf@prnewswire.com         Male   9.59
16   17            Kaye Thick        Thick              kthickg@dropbox.com       Female   5.91
17   18      Cacilie Presslee     Presslee             cpressleeh@sogou.com       Female   8.05
18   19     Robinson Baptiste     Baptiste           rbaptistei@storify.com         Male   6.52
19   20         Freddy Osment       Osment              fosmentj@usnews.com         Male   6.20
20   21      Meredith Rudiger      Rudiger        mrudigerk@fastcompany.com      Agender   8.00
21   22      Bobbie Laingmaid    Laingmaid               blaingmaidl@ft.com         Male   9.46
22   23     Winfred Kolakovic    Kolakovic      wkolakovicm@istockphoto.com         Male   4.61
23   24          Shelba Braid        Braid          sbraidn@tripadvisor.com       Female   8.10
24   25         Morna Jansema      Jansema        mjansemao@marketwatch.com   Non-binary   9.91
25   26         Karel Speller      Speller              kspellerp@house.gov       Female   1.37
26   27         Conway Fallon       Fallon            cfallonq@so-net.ne.jp         Male   3.58
27   28       Ninette Riddett      Riddett            nriddettr@comcast.net       Female   4.20
28   29            Roi Hinsch       Hinsch              rhinschs@uol.com.br         Male   3.36
29   30     Frannie Matteuzzi    Matteuzzi        fmatteuzzit@quantcast.com       Female   3.75
30   31         Che Bratchell    Bratchell     cbratchellu@reverbnation.com         Male   9.59
31   32        Audra Brettell     Brettell               abrettellv@irs.gov       Female   2.97
32   33     Jordan Antognelli   Antognelli       jantognelliw@people.com.cn  Genderqueer   8.04
33   34        Jeanine McCosh       McCosh         jmccoshx@list-manage.com       Female   5.87
34   35        Karyn Klementz     Klementz            kklementzy@netlog.com       Female   1.24
35   36      Sheilah Foystone     Foystone          sfoystonez@sakura.ne.jp       Female   8.96
36   37            Way Playle       Playle                wplayle10@mapy.cz         Male   4.78
37   38    Kippar Kadwallider  Kadwallider        kkadwallider11@paypal.com         Male   6.44
38   39         Cindee Freire       Freire          cfreire12@xinhuanet.com       Female   1.65
39   40        Reeta Roscrigg     Roscrigg              rroscrigg13@irs.gov       Female   9.36
40   41       Berry Colegrove    Colegrove    bcolegrove14@chronoengine.com       Female   9.23
41   42        Tasha Frampton     Frampton            tframpton15@jimdo.com  Genderqueer   9.36
42   43       Donovan Bezzant      Bezzant           dbezzant16@blogger.com         Male   9.92
43   44         Andee Beretta      Beretta         aberetta17@reference.com       Female   1.74
44   45       Sheffy Prozillo     Prozillo            sprozillo18@ifeng.com         Male   4.51
45   46          Kizzie Keane        Keane           kkeane19@instagram.com       Female   3.71
46   47        Carlie Peppard      Peppard          cpeppard1a@mapquest.com         Male   7.68
47   48           Gusta Royan        Royan            groyan1b@illinois.edu       Female   2.47
48   49             Roy Stodd        Stodd               rstodd1c@salon.com         Male   5.17
49   50       Horace Surgenor     Surgenor        hsurgenor1d@amazonaws.com         Male   1.11
50   51          Murial Blogg        Blogg         mblogg1e@studiopress.com       Female   4.91
51   52        Grissel Lozano       Lozano             glozano1f@senate.gov       Female   7.82
52   53     Gilberto Tomasini     Tomasini           gtomasini1g@seesaa.net         Male   1.94
53   54       Bertina Iowarch      Iowarch              biowarch1h@yelp.com       Female   5.55
54   55   Corinne Tocqueville  Tocqueville        ctocqueville1i@oracle.com  Genderfluid   7.21
55   56           Galen Reeks        Reeks               greeks1j@opera.com         Male   3.26
56   57       Violette Suttle       Suttle           vsuttle1k@bluehost.com       Female   4.11
57   58        Colleen Coates       Coates            ccoates1l@plala.or.jp       Female   8.84
58   59           Lydon Swaby        Swaby           lswaby1m@bloomberg.com  Genderfluid   4.42
59   60        Daniel Klaiser      Klaiser             dklaiser1n@blogs.com         Male   4.80
60   61         Charyl Casine       Casine           ccasine1o@hatena.ne.jp       Female   4.53
61   62   Charity MacTurlough  MacTurlough        cmacturlough1p@disqus.com       Female   3.41
62   63      Meredith Kaufman      Kaufman             mkaufman1q@google.nl       Female   8.22
63   64        Othello Meriot       Meriot             omeriot1r@amazon.com         Male   1.13
64   65         Betsey Huonic       Huonic        bhuonic1s@ycombinator.com       Female   7.53
65   66     Gavrielle Lamprey      Lamprey     glamprey1t@howstuffworks.com       Female   5.55
66   67   Chiquita MacCartair   MacCartair       cmaccartair1u@columbia.edu      Agender   5.98
67   68        Lawrence Grace        Grace            lgrace1v@hubpages.com         Male   5.16
68   69        Juliane Olivie       Olivie          jolivie1w@quantcast.com       Female   9.70
69   70       Nanette Bonifas      Bonifas         nbonifas1x@pinterest.com       Female   9.25
70   71         Ardella Boyle        Boyle                 aboyle1y@fc2.com       Female   6.62
71   72           Ber Melburg      Melburg          bmelburg1z@yolasite.com         Male   6.64
72   73         Christy Drepp        Drepp               cdrepp20@mysql.com       Female   7.49
73   74     Remington Boydell      Boydell            rboydell21@netlog.com         Male   8.20
74   75      Rutger Gallymore    Gallymore            rgallymore22@usda.gov         Male   9.88
75   76          Alis Lindsey      Lindsey               alindsey23@ftc.gov       Female   4.01
76   77      Amalle Burmaster    Burmaster      aburmaster24@vistaprint.com      Agender   3.62
77   78        Alonzo Birtles      Birtles           abirtles25@samsung.com         Male   3.18
78   79       Barbara Edgeler      Edgeler         bedgeler26@tuttocitta.it       Female   9.75
79   80     Alasdair Spancock     Spancock             aspancock27@etsy.com         Male   9.99
80   81        Marylou Moxley       Moxley       mmoxley28@wunderground.com       Female   9.94
81   82       Ario Stanbridge   Stanbridge     astanbridge29@thetimes.co.uk         Male   7.29
82   83      Sebastiano Camis        Camis               scamis2a@google.de         Male   9.07
83   84       Vidovic Chstney      Chstney           vchstney2b@answers.com         Male   5.73
84   85        Dorrie Nijssen      Nijssen            dnijssen2c@dyndns.org       Female   9.54
85   86     Marjory Parkhouse    Parkhouse            mparkhouse2d@sohu.com       Female   8.32
86   87           Athena Nuss         Nuss           anuss2e@altervista.org       Female   6.86
87   88       Rriocard Kearey       Kearey                rkearey2f@ftc.gov         Male   6.15
88   89       Margaux Peskett      Peskett              mpeskett2g@admin.ch       Female   4.22
89   90       Avigdor Christy      Christy         achristy2h@amazonaws.com         Male   4.51
90   91        Theodore Haime        Haime             thaime2i@arizona.edu         Male   3.10
91   92           Hally Jordi        Jordi           hjordi2j@posterous.com       Female   5.00
92   93    Jackqueline Galier       Galier           jgalier2k@redcross.org       Female   5.94
93   94        Derron Handlin      Handlin         dhandlin2l@over-blog.com         Male   4.51
94   95         Atlante Lusty        Lusty                  alusty2m@go.com     Bigender   3.91
95   96          Fae Fruchter     Fruchter               ffruchter2n@un.org       Female   3.65
96   97          Scotti Tiddy        Tiddy  stiddy2o@scientificamerican.com         Male   9.93
97   98        Kingsly Upsale       Upsale             kupsale2p@taobao.com      Agender   8.48
98   99        Irwin Olivazzi     Olivazzi           iolivazzi2q@sphinn.com      Agender   6.17
99  100        Devy Ratcliffe    Ratcliffe               dratcliffe2r@51.la         Male   1.38

In [41]:
student_data.head(3) #first 3 rows

   id        first_name  last_name                   email  gender  grade
0   1     Ilsa McKinnon   McKinnon      imckinnon0@cmu.edu  Female   5.15
1   2  Anabel Atterbury  Atterbury  aatterbury1@paypal.com  Female   4.97
2   3       Nappie Yude       Yude      nyude2@twitpic.com    Male   1.63

In [42]:
student_data.tail(3)

     id      first_name  last_name                   email   gender  grade
97   98  Kingsly Upsale     Upsale    kupsale2p@taobao.com  Agender   8.48
98   99  Irwin Olivazzi   Olivazzi  iolivazzi2q@sphinn.com  Agender   6.17
99  100  Devy Ratcliffe  Ratcliffe      dratcliffe2r@51.la     Male   1.38

In [43]:
# number of rows and column
student_data.shape

(100, 6)

In [46]:
student_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          100 non-null    int64
 1   first_name  100 non-null    object
 2   last_name   100 non-null    object
 3   email       100 non-null    object
 4   gender      100 non-null    object
 5   grade       100 non-null    float64
dtypes: float64(1), int64(1), object(4)
memory usage: 4.8+ KB

In [51]:
student_data.describe()

               id       grade
count  100.000000  100.000000
mean    50.500000    5.876300
std     29.011492    2.697613
min      1.000000    1.110000
25%     25.750000    3.870000
50%     50.500000    5.800000
75%     75.250000    8.205000
max    100.000000    9.990000

In [53]:
student_data[['id','grade']].head()

   id  grade
0   1   5.15
1   2   4.97
2   3   1.63
3   4   9.83
4   5   4.21

In [55]:
student_data['grade'].describe()

count    100.000000
mean       5.876300
std        2.697613
min        1.110000
25%        3.870000
50%        5.800000
75%        8.205000
max        9.990000
Name: grade, dtype: float64